Autodesk.Revit.DB.FailureDefinition.AddResolutionType(Autodesk.Revit.DB.FailureResolutionType,System.String,System.Type)
Adds a type of possible resolution for the failure.
Remarks:
In order to inform Revit what failure resolutions can be possibly used with a given failure, a FailureDefinition must
contain a full list of resolution types applicable to the failure, including user-visible caption and runtime class of the
resolution. The number of resolutions is not limited. The first added resolution becomes the default resolution.
type:
Type of the resolution to add. The type of resolution can be used only once for the FailureDefinition.
caption:
A simple description of the resolution.
classOfResolution:
The runtime class of the resolution. Used to ensure that the actual FailureResoution object added to the instance of FailureMessage
belongs to an applicable class.
Returns:
The FailureDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The type has already been added as a resolution to the FailureDefinition.
-or-
The input classOfResolution is not a subclass of FailureResolution.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.FailureDefinition.CreateFailureDefinition(Autodesk.Revit.DB.FailureDefinitionId,Autodesk.Revit.DB.FailureSeverity,System.String)
Creates an instance of a FailureDefinition.
Remarks:
The newly created FailureDefinition will be added to the FailureDefinitionRegistry. Because FailureDefinition
could only be registered when Revit starting up, this function cannot be used after Revit has already started.
Throws InvalidOperationException if invoked after Revit start-up is completed.
id:
Unique identifier of the failure.
severity:
The severity of the failure. Cannot be FailureSeverity::None.
messageString:
A user-visible string describing the failure.
Returns:
The created FailureDefinition instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The id of failure definition is not valid.
-or-
The id of failure definition is already used to register another FailureDefinition.
-or-
The severity of failures cannot be FailureSeverity::None.
-or-
Message string is empty or contains invalid characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011